Revit 2026 API

# OptionalFunctionalityUtilsIsAXMImportLinkAvailable Method

---

Checks whether the AXM Import/Link functionality is available in the installed Revit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsAXMImportLinkAvailable()
```
```vb
Public Shared Function IsAXMImportLinkAvailable As Boolean
```
```cpp
public:
static bool IsAXMImportLinkAvailable()
```
```fsharp
static member IsAXMImportLinkAvailable : unit -> bool
```

#### Return Value

Boolean True if the AXM Import/Link functionality is available in the installed Revit.

AXM Import/Link is optional functionality that does not have to be part of the Revit installation.

#### Reference

OptionalFunctionalityUtils Class

Autodesk.Revit.DB Namespace